kvzhao/FreeRTOS-STM32F4/Libraries/STM32F4xx_StdPeriph_Driver/inc/stm32f4xx_lis3dsh.h
/*	Rejestr OUT_T ------------- Temperature Output ------------------------------------------------
*	Default value: ---
*	Read only register
*
*	Temperature output register.
*	Temperature data (1LSB/deg - 8-bit resolution).
*	The value is expressed as two's complement.
*
*/
#define LIS3DSH_OUT_T_ADDR					0x0c

/*	Rejestr OFFSET_X ---------- X-axis offset correction ------------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Offset correction X-axis register,signed value.
*/
#define LIS3DSH_OFFSET_X_ADDR				0x10

/*	Rejestr OFFSET_Y ---------- Y-axis offset correction ------------------------------------------
*	Default value: 0
*	 Read Write register
*
*	 Offset correction Y-axis register, signed value.
*/
#define LIS3DSH_OFFSET_Y_ADDR				0x11

/*	Rejestr OFFSET_Z ---------- Z-axis offset correction ------------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Offset correction Z-axis register, signed value.
*/
#define LIS3DSH_OFFSET_Z_ADDR				0x12

/*	Rejestr CS_X -------------- Constant shift X --------------------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Constant shift signed value X-axis register - state machine only.
*/
#define LIS3DSH_CS_X_ADDR					0x13

/*	Rejestr CS_Y -------------- Constant shift Y --------------------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Constant shift signed value Y-axis register - state machine only
*/
#define LIS3DSH_CS_Y_ADDR					0x14

/*	Rejestr CS_Z -------------- Constant shift Z --------------------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Constant shift signed value Y-axis register - state machine only.
*/
#define LIS3DSH_CS_Z_ADDR					0x15

/*	Rejestr LC ---------------- Long counter registers --------------------------------------------
*	Default value: 1
*	Read/Write register
*
*	16-bit long-counter register for interrupt state machine programs timing.
*	01h=counting stopped, 00h=counter full: interrupt available and counter is set to default.
*	Values higher than 00h:counting
*/
#define LIS3DSH_LC_H_ADDR					0x16
#define LIS3DSH_LC_L_ADDR					0x17

/*	Rejestr STAT -------------- Interrupt status - interrupt synchronization register -------------
*	Default value: ---
*	Read only register
*
*		bit:
*			7:LONG		interrupt flag common for both SM
*				0: no interrupt
*				1: long counter (LC)
*			6:SYNCW		Synchronization for external Host Controller interrupt based on output data
*				0: no action waiting from host
*				1: action from host based on output data
*			5:SYNC1
*				0: SM1 running normally
*				1: SM1 stopped and await restart request from SM2
*			4:SYNC2
*				0: SM2 running normally
*				1: SM2 stopped and await restart request from SM1
*			3:INT_SM1	SM1 - Interrupt Selection
*				0: SM1 interrupt disable
*				1: SM1 interrupt enable
*			2:INT_SM2	SM2 - Interrupt Selection
*				0: SM2 interrupt disable
*				1: SM2 interrupt enable
*			1:DOR		Data overrun indicates not read data from output register when
*						next data samples measure start
*				0: no overrun
*				1: data overrun data overrun bit is reset when next
sample is ready
*			0:DRDY
*/
#define LIS3DSH_STAT_ADDR					0x18
#define _LIS3DSH_LONG			7
#define _LIS3DSH_SYNCW			6
#define _LIS3DSH_SYNC1			5
#define _LIS3DSH_SYNC2			4
#define _LIS3DSH_INT_SM1		3
#define _LIS3DSH_INT_SM2		2
#define _LIS3DSH_DOR			1
#define _LIS3DSH_DRDY			0

/*	Rejestr VFC_1 ------------- Vector filter coefficient 1 ---------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Vector coefficient register 1 for DIff filter.
*/
#define LIS3DSH_VFC_1_ADDR					0x1b

/*	Rejestr VFC_2 ------------- Vector filter coefficient 2 ---------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Vector coefficient register 2 for DIff filter.
*/
#define LIS3DSH_VFC_2_ADDR					0x1c

/*	Rejestr VFC_3 ------------- Vector filter coefficient 3 ---------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Vector coefficient register 3 for FSM2 filter.
*/
#define LIS3DSH_VFC_3_ADDR					0x1d

/*	Rejestr VFC_4 ------------- Vector filter coefficient 4 ---------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Vector coefficient register 4 for DIff filter.
*/
#define LIS3DSH_VFC_4_ADDR					0x1e

/*	Rejestr THRS3 ------------ Threshold value 3 --------------------------------------------------
*	Default value: 0
*	Read/Write register
*
*	Threshold value register.
*/
#define LIS3DSH_THRS3_ADDR					0x1f

/*	Rejestr OUT_X ------------ Output register X --------------------------------------------------
*	Default value: 0
*	Read only register
*
*	X-axis output register.
*/
#define LIS3DSH_OUT_X_L_ADDR				0x28
#define LIS3DSH_OUT_X_H_ADDR				0x29

/*	Rejestr OUT_Y ------------ Output register Y --------------------------------------------------
*	Default value: 0
*	Read only register
*
*	Y-axis output register.
*/
#define LIS3DSH_OUT_Y_L_ADDR				0x2a
#define LIS3DSH_OUT_Y_H_ADDR				0x2b

/*	Rejestr OUT_Z ------------ Output register Z --------------------------------------------------
*	Default value: 0
*	Read only register
*
*	Z-axis output register.
*/
#define LIS3DSH_OUT_Z_L_ADDR				0x2c
#define LIS3DSH_OUT_Z_H_ADDR				0x2d

/*	Rejestr FIFO_CTRL -------- FIFO control register ----------------------------------------------
*	Default value: ---
*	Read/write register
*
*		bit:
*			7:FMODE2	FMODE[2:0] FIFO Mode Selection.
*			6:FMODE1
*			5:FMODE0
*				FMODE2	FMODE1	FMODE0	MODE
*					0		0		0	Bypass Mode. FIFO turned off
*					0		0		1	FIFO Mode. Stop collecting data when FIFO is full.
*					0		1		0	Stream Mode. If the FIFO is full the new sample
*										overwrites the older one
*					0		1		1	Stream mode until trigger is deasserted, then FIFO mode
*					1		0		0	Bypass mode until trigger is deasserted, then Stream mode
*					1		0		1	Not Used.
*					1		1		0	Not Used.
*					1		1		1	Bypass mode until trigger is deasserted, then FIFO mode
*			4:WTMP4		WTMP[4:0] - FIFO Watermark pointer; FIFO deep if the Watermark is enabled.
*			3:WTMP3
*			2:WTMP2
*			1:WTMP1
*			0:WTMP0
*/
#define LIS3DSH_FIFO_CTRL_ADDR				0x2e
#define _LIS3DSH_FMODE2		7
#define _LIS3DSH_FMODE1		6
#define _LIS3DSH_FMODE0		5
#define _LIS3DSH_WTMP4		4
#define _LIS3DSH_WTMP3		3
#define _LIS3DSH_WTMP2		2
#define _LIS3DSH_WTMP1		1
#define _LIS3DSH_WTMP0		0

/*	Rejestr FIFO_SRC --------- FIFO SRC control register ------------------------------------------
*	Default value: ---
*	Read only register
*
*		bit:
*			7:WTM		Watermark status.
*				0: FIFO filling is lower than WTM level
*				1: FIFO filling is equal or higher than WTM level
*			6:OVRN FIFO	Overrun bit status
*				0: FIFO is not completely filled
*				1: FIFO is completely filled
*			5:EMPTY		FIFO empty bit
*				0: FIFO not empty
*				1: FIFO empty)
*			4:FSS4		FSS[4:0] FIFO stored data level
*			3:FSS3
*			2:FSS2
*			1:FSS1
*			0:FSS0
*/
#define LIS3DSH_FIFO_SRC_ADDR				0x2f
#define _LIS3DSH_WTM		7
#define _LIS3DSH_OVRN		6
#define _LIS3DSH_EMPTY		5
#define _LIS3DSH_FSS4		4
#define _LIS3DSH_FSS3		3
#define _LIS3DSH_FSS2		2
#define _LIS3DSH_FSS1		1
#define _LIS3DSH_FSS0		0

/*	Rejestr CTRL_REG1 -------- SM1 control register -----------------------------------------------
*	Default value: 0
*	Read/write register
*
*		bit:
*			7:HYST2_1		Hysteresis unsigned value to be added
*							or subtracted from threshold value in SM1
*			6:HYST1_1
*			5:HYST0_1
*				Default value: 000
*			4: -
*			3:SM1_PIN
*				Default value:0
*				0: SM1 interrupt routed to INT1
*				1: SM1 interrupt routed to INT2 pin
*			2: -
*			1: -
*			0:SM1_EN
*				Default value: 0
*				0: SM1 disabled
*				1: SM1 enabled
*/
#define LIS3DSH_CTRL_REG1_ADDR				0x21
#define _LIS3DSH_HYST2_1		7
#define _LIS3DSH_HYST1_1		6
#define _LIS3DSH_HYST0_1		5
#define _LIS3DSH_SM1_PIN		3
#define _LIS3DSH_SM1_EN			0

