kvzhao/FreeRTOS-STM32F4/Libraries/STM32F4xx_StdPeriph_Driver/inc/stm32f4xx_lis3dsh.h
/*	Rejestr SETT2 ------------ SM2 detection settings ---------------------------------------------
*	Default value: ---
*	Write only register
*
*	Setting of threshold, peak detection and flags for SM2 motion detection operation.
*
*		bit:
*			7:P_DET			SM2 peak detection
*				Default value: 0
*				0: peak detection disabled
*				1: peak detection enabled
*			6:THR3_SA
*				Default value: 0
*				0: no action
*				1: threshold 3 limit value for axis and sign mask reset (MASK2_B)
*			5:ABS
*				Default value: 0
*				0: unsigned thresholds
*				1: signed thresholds
*			4:-
*			3:-
*			2:THR3_MA
*				Default value: 0
*				0: no action
*				1: threshold 3 limit value for axis and sign mask reset (MASK2_A)
*			1:RTAM			Next condition validation flag
*				Default value: 0
*				0: no valid next condition found
*				1: valid next condition found and reset
*			0:SITR
*				Default value: 0
*				0: no actions
*				1: program flow can be modified by STOP and CONT commands
*/
#define LIS3DSH_SETT2_ADDR					0x7b
#define _LIS3DSH_P_DET		7
#define _LIS3DSH_THR3_SA	6
#define _LIS3DSH_ABS		5
#define _LIS3DSH_THR3_MA	2
#define _LIS3DSH_RTAM		1
#define _LIS3DSH_SITR		0

/*	Rejestr PR2 -------------- Program-reset pointer ----------------------------------------------
*	Default value: ---
*	Read only register
*
*	Program and reset pointer for SM2 motion detection operation.
*
*		bit:
*			7:PP3		PP[3:0] SM2 program pointer address
*			6:PP2
*			5:PP1
*			4:PP0
*			3:PR3		PR[3:0] SM2 reset pointer address
*			2:PR2
*			1:PR1
*			0:PR0
*/
#define LIS3DSH_RP2_ADDR					0x7c
#define _LIS3DSH_PP3		7
#define _LIS3DSH_PP2		6
#define _LIS3DSH_PP1		5
#define _LIS3DSH_PP0		4
#define _LIS3DSH_PR3		3
#define _LIS3DSH_PR2		2
#define _LIS3DSH_PR1		1
#define _LIS3DSH_PR0		0

/*	Rejestr TC2 -------------- Timer counter ------------------------------------------------------
*	Default value: ---
*	Read only registers
*
*	16-bit general timer (unsigned output value) for SM2 operation timing.
*/
#define LIS3DSH_TC2_L_ADDR					0x7d
#define LIS3DSH_TC2_H_ADDR					0x7e

/*	Rejestr OUTS2 ------------ Main set flag ------------------------------------------------------
*	Default value: ---
*	Read only register
*
*	Output flags on axis for interrupt SM2 management.
*
*		bit:
*			7:P_X
*				0: X + no show
*				1: X + show
*			6:N_X
*				0: X - no show
*				1: X - show
*			5:P_Y
*				0: X + no show
*				1: X + show
*			4:N_Y
*				0: X - no show
*				1: X - show
*			3:P_Z
*				0: X + no show
*				1: X + show
*			2:N_Z
*				0: X - no show
*				1: X - show
*			1:P_V
*				0: X + no show
*				1: X + show
*			0:N_V
*				0: X - no show
*				1: X - show
*/
#define LIS3DSH_OUTS2_ADDR					0x7f
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Rejestr PEAK2 ------------ Peak value ---------------------------------------------------------
*	Default value: ---
*	Read only register
*
*	Peak detection value register for SM2 operation.
*/
#define LIS3DSH_PEAK2_ADDR					0x1a

/*	Rejestr DES2 ------------- Decimation factor --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	Decimation counter value register for SM2 operation.
*/
#define LIS3DSH_DES2_ADDR					0x78

/**************************************************************************************************
 * Registers marked as ‘Reserved’ must not be changed. The writing to those registers may		  *
 * cause permanent damages to the device. The content of the registers that are loaded 			  *
 * at boot should not be changed. They contain the factory calibration values. 					  *
 * Their content is automatically restored when the device is powered up.						  *
 **************************************************************************************************/

#define LIS3DSH_CS_LOW()       GPIO_ResetBits(LIS3DSH_SPI_CS_GPIO_PORT, LIS3DSH_SPI_CS_PIN)
#define LIS3DSH_CS_HIGH()      GPIO_SetBits(LIS3DSH_SPI_CS_GPIO_PORT, LIS3DSH_SPI_CS_PIN)

void lis3dsh_init();
void lis3dsh_set_OutputDataRate(lis3dsh_register odr_selection);
void lis3dsh_AxesEnable(lis3dsh_register axes);
void lis3dsh_int1_enable();
void lis3dsh_ReadAxes(LIS3DSH_OutXYZTypeDef* axes);
lis3dsh_register lis3dsh_read_register(lis3dsh_register addres);
void lis3dsh_read_block(uint8_t* buf, uint8_t addres, uint16_t size);
void lis3dsh_write_register(lis3dsh_register addres,lis3dsh_register value);
void lis3dsh_write_block(lis3dsh_register* buf,lis3dsh_register addres,lis3dsh_register size);

uint8_t lis3dsh_timeout_usercallback(void);

#endif /* STM32F4_DISCOVERY_LIS3DSH_H_ */
